<b> Pandas is a Python package providing fast, flexible, and expressive data structures designed to make working with structured (tabular, multidimensional, potentially heterogeneous) and time series data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python. </b>

<b>Pandas</b> is designed to make it easier to work with structured data. Most of the analyses you might perform will likely involve using tabular data, e.g., from .csv files or relational databases (e.g., SQL). The DataFrame object in pandas is "a two-dimensional tabular, column-oriented data structure with both row and column labels."

Pandas Cheatsheet: https://assets.datacamp.com/blog_assets/PandasPythonForDataScience.pdf

Here are just a few of the things that pandas does well:

* Robust IO tools for loading data from flat files (CSV and delimited), Excel files, databases, and saving / loading data from the ultrafast HDF5 format
* Easy handling of missing data (represented as NaN) in floating point as well as non-floating point data
* Size mutability: columns can be inserted and deleted from DataFrame and higher dimensional objects
* Automatic and explicit data alignment: objects can be explicitly aligned to a set of labels, or the user can simply ignore the labels and let Series, DataFrame, etc. automatically align the data for you in computations
* Powerful, flexible group by functionality to perform split-apply-combine operations on data sets, for both aggregating and transforming data
* Make it easy to convert ragged, differently-indexed data in other Python and NumPy data structures into DataFrame objects
* Intelligent label-based slicing, fancy indexing, and subsetting of large data sets
* Intuitive merging and joining data sets
* Flexible reshaping and pivoting of data sets
* Hierarchical labeling of axes (possible to have multiple labels per tick)*
* Time series-specific functionality: date range generation and frequency conversion, moving window statistics, moving window linear regressions, date shifting and lagging, etc.



If you're curious:

The pandas name itself is derived from panel data, an econometrics term for multidimensional structured data sets, and Python data analysis itself. After getting introduced, you can consult the full pandas documentation. 
https://pandas.pydata.org/pandas-docs/stable/?v=20190919220335

### Today we will cover 
* Introduction of series and dataframe
* Load csv, excel and json file from location
* Saving file to location

In [1]:
#Import package
import pandas as pd
import numpy as np

In [2]:
# Version of pandas
pd.__version__

'0.24.2'

In [3]:
# Help 
help(pd.DataFrame.sum) 
# Can also refer https://pandas.pydata.org/pandas-docs/stable/?v=20190913225125

Help on function sum in module pandas.core.frame:

sum(self, axis=None, skipna=None, level=None, numeric_only=None, min_count=0, **kwargs)
    Return the sum of the values for the requested axis.

                This is equivalent to the method ``numpy.sum``.

    Parameters
    ----------
    axis : {index (0), columns (1)}
        Axis for the function to be applied on.
    skipna : bool, default True
        Exclude NA/null values when computing the result.
    level : int or level name, default None
        If the axis is a MultiIndex (hierarchical), count along a
        particular level, collapsing into a Series.
    numeric_only : bool, default None
        Include only float, int, boolean columns. If None, will attempt to use
        everything, then use only numeric data. Not implemented for Series.
    min_count : int, default 0
        The required number of valid values to perform the operation. If fewer than
        ``min_count`` non-NA values are present the result will be NA.

        .. versionadded :: 0.22.0

           Added with the default being 0. This means the sum of an all-NA
           or empty Series is 0, and the product of an all-NA or empty
           Series is 1.
    **kwargs
        Additional keyword arguments to be passed to the function.

    Returns
    -------
    sum : Series or DataFrame (if level specified)

    See Also
    --------
    Series.sum : Return the sum.
    Series.min : Return the minimum.
    Series.max : Return the maximum.
    Series.idxmin : Return the index of the minimum.
    Series.idxmax : Return the index of the maximum.
    DataFrame.min : Return the sum over the requested axis.
    DataFrame.min : Return the minimum over the requested axis.
    DataFrame.max : Return the maximum over the requested axis.
    DataFrame.idxmin : Return the index of the minimum over the requested axis.
    DataFrame.idxmax : Return the index of the maximum over the requested axis.

    Examples
    --------

    >>> idx = pd.MultiIndex.from_arrays([
    ...     ['warm', 'warm', 'cold', 'cold'],
    ...     ['dog', 'falcon', 'fish', 'spider']],
    ...     names=['blooded', 'animal'])
    >>> s = pd.Series([4, 2, 0, 8], name='legs', index=idx)
    >>> s
    blooded  animal
    warm     dog       4
             falcon    2
    cold     fish      0
             spider    8
    Name: legs, dtype: int64

    >>> s.sum()
    14

    Sum using level names, as well as indices.

    >>> s.sum(level='blooded')
    blooded
    warm    6
    cold    8
    Name: legs, dtype: int64

    >>> s.sum(level=0)
    blooded
    warm    6
    cold    8
    Name: legs, dtype: int64

    By default, the sum of an empty or all-NA Series is ``0``.

    >>> pd.Series([]).sum()  # min_count=0 is the default
    0.0

    This can be controlled with the ``min_count`` parameter. For example, if
    you'd like the sum of an empty series to be NaN, pass ``min_count=1``.

    >>> pd.Series([]).sum(min_count=1)
    nan

    Thanks to the ``skipna`` parameter, ``min_count`` handles all-NA and
    empty series identically.

    >>> pd.Series([np.nan]).sum()
    0.0

    >>> pd.Series([np.nan]).sum(min_count=1)
    nan

### Introduction of series and dataframe

<b>Series:</b> One dimension list

<b>Data Frame:</b> A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

In [4]:
# Series
s = pd.Series([2, 3, 5, 6, 8],index=['a', 'b', 'd','e','f'])
#print(s.astype('int'))
print(s[0])
print(s['a'])

2
2

In [5]:
#Data Frame
df = pd.DataFrame(np.random.randint(4, 6,(3,4)), columns=['Ax','B','C','D'])
print(df)
df['Ax']

   Ax  B  C  D
0   5  5  5  4
1   4  4  5  5
2   5  4  4  4

0    5
1    4
2    5
Name: Ax, dtype: int64

In [6]:
# initialize list of lists 
data = np.array([['amar', 10], ['akbar', 15], ['anthony', 14]])
print(data.shape)
  
# Create the pandas DataFrame 
df = pd.DataFrame(data, columns = ['Name', 'Age']) 
  
# print dataframe. 
df

(3, 2)

      Name Age
0     amar  10
1    akbar  15
2  anthony  14

In [7]:
# intialise data of lists. 
data = {'Name':['Tom', 'nick', 'don', 'harry'], 'Age':[20, 21, 19, 18]} 
  
# Create DataFrame 
df = pd.DataFrame(data) 
  
# Print the output. 
df

    Name  Age
0    Tom   20
1   nick   21
2    don   19
3  harry   18

In [8]:
# Intialise data to Dicts of series. 
d = {'one' : pd.Series([10, 20, 30, 40], index =['a', 'b', 'c', 'd']), 
      'two' : pd.Series([10, 20, 30, 40], index =['a', 'b', 'c', 'e'])} 
  
# creates Dataframe. 
df = pd.DataFrame(d) 
  
# print the data. 
df

    one   two
a  10.0  10.0
b  20.0  20.0
c  30.0  30.0
d  40.0   NaN
e   NaN  40.0

In [9]:
# initialise data of lists. 
data = {'Name':['Tom', 'don', 'nick', 'juli'], 'marks':[99, 98, 95, 90]} 
  
# Creates pandas DataFrame. 
df = pd.DataFrame(data, index =['rank1', 'rank2', 'rank3', 'rank4']) 

# print the data 
df

       Name  marks
rank1   Tom     99
rank2   don     98
rank3  nick     95
rank4  juli     90

In [10]:
# # Initialise data to lists. 
# data = [{'a': 1, 'b': 2, 'c':3}, {'a':10, 'b': 20, 'c': 30}] 
  
# # Creates DataFrame. 
# df = pd.DataFrame(data) 
  
# # Print the data 
# df 
# Exmaple if number of columns are different
data = [{'b': 2, 'c':3}, {'a': 10, 'b': 20, 'c': 30}] 
df = pd.DataFrame(data, index =['first', 'second']) 
df

           a   b   c
first    NaN   2   3
second  10.0  20  30

In [11]:
# List1  
Name = ['tom', 'krish', 'nick', 'juli']  
    
# List2  
Age = [ 34,54,67,np.nan ]  
    
# get the list of tuples from two lists.  
# and merge them by using zip().  
list_of_tuples = list(zip(Name, Age))  
    
# Assign data to tuples.  
# list_of_tuples   
  
  
# ## Converting lists of tuples into pandas Dataframe.  

df = pd.DataFrame(list_of_tuples, columns = ['Name', 'Age'],index=list('abcd'))  # ['a','b','c','d'] 
     
# Print data.  
df

    Name   Age
a    tom  34.0
b  krish  54.0
c   nick  67.0
d   juli   NaN

In [12]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [13]:
df = pd.DataFrame(np.random.randn(15, 4), columns=['A','B','C','D'])
df

           A         B         C         D
0  -0.793501  0.303682 -2.438304  0.135801
1  -0.317886 -0.382391 -0.030949  0.006409
2   0.713554 -1.474044 -1.611839  1.256339
3   1.152904  0.875935 -0.695734 -0.173973
4   0.349070  0.145427 -0.647036 -2.044697
5   0.411428 -1.026737 -1.153064 -1.858064
6  -0.022134 -0.838588  1.034511  1.086838
7   0.311615 -0.175301 -0.063252  2.947099
8   0.112965 -0.025156  0.290681  1.517684
9   1.073733  0.009069  1.434101 -0.324224
10 -1.914762 -0.265914 -2.622818 -0.203193
11  0.223135 -2.107193  0.335140 -1.229198
12 -0.935120  1.085023  1.426574 -0.055636
13 -1.210220  0.094843 -0.890266 -0.723416
14 -0.858159  0.079016  0.943580  0.401332

In [14]:
# Head, tail, columns, index
df.head() #  First 5 values

          A         B         C         D
0 -0.793501  0.303682 -2.438304  0.135801
1 -0.317886 -0.382391 -0.030949  0.006409
2  0.713554 -1.474044 -1.611839  1.256339
3  1.152904  0.875935 -0.695734 -0.173973
4  0.349070  0.145427 -0.647036 -2.044697

In [15]:
print(df.tail(2)) # Last 5 values

           A         B         C         D
13 -1.210220  0.094843 -0.890266 -0.723416
14 -0.858159  0.079016  0.943580  0.401332

In [16]:
print(df.columns)

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
print(df.index)

RangeIndex(start=0, stop=15, step=1)

In [18]:
print(df)

           A         B         C         D
0  -0.793501  0.303682 -2.438304  0.135801
1  -0.317886 -0.382391 -0.030949  0.006409
2   0.713554 -1.474044 -1.611839  1.256339
3   1.152904  0.875935 -0.695734 -0.173973
4   0.349070  0.145427 -0.647036 -2.044697
5   0.411428 -1.026737 -1.153064 -1.858064
6  -0.022134 -0.838588  1.034511  1.086838
7   0.311615 -0.175301 -0.063252  2.947099
8   0.112965 -0.025156  0.290681  1.517684
9   1.073733  0.009069  1.434101 -0.324224
10 -1.914762 -0.265914 -2.622818 -0.203193
11  0.223135 -2.107193  0.335140 -1.229198
12 -0.935120  1.085023  1.426574 -0.055636
13 -1.210220  0.094843 -0.890266 -0.723416
14 -0.858159  0.079016  0.943580  0.401332

In [19]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 4 columns):
A    15 non-null float64
B    15 non-null float64
C    15 non-null float64
D    15 non-null float64
dtypes: float64(4)
memory usage: 560.0 bytes
None

### Rename

In [20]:
df

           A         B         C         D
0  -0.793501  0.303682 -2.438304  0.135801
1  -0.317886 -0.382391 -0.030949  0.006409
2   0.713554 -1.474044 -1.611839  1.256339
3   1.152904  0.875935 -0.695734 -0.173973
4   0.349070  0.145427 -0.647036 -2.044697
5   0.411428 -1.026737 -1.153064 -1.858064
6  -0.022134 -0.838588  1.034511  1.086838
7   0.311615 -0.175301 -0.063252  2.947099
8   0.112965 -0.025156  0.290681  1.517684
9   1.073733  0.009069  1.434101 -0.324224
10 -1.914762 -0.265914 -2.622818 -0.203193
11  0.223135 -2.107193  0.335140 -1.229198
12 -0.935120  1.085023  1.426574 -0.055636
13 -1.210220  0.094843 -0.890266 -0.723416
14 -0.858159  0.079016  0.943580  0.401332

In [21]:
df.rename({'Name':'Rename'},axis=1,inplace = True) #

In [22]:
df

           A         B         C         D
0  -0.793501  0.303682 -2.438304  0.135801
1  -0.317886 -0.382391 -0.030949  0.006409
2   0.713554 -1.474044 -1.611839  1.256339
3   1.152904  0.875935 -0.695734 -0.173973
4   0.349070  0.145427 -0.647036 -2.044697
5   0.411428 -1.026737 -1.153064 -1.858064
6  -0.022134 -0.838588  1.034511  1.086838
7   0.311615 -0.175301 -0.063252  2.947099
8   0.112965 -0.025156  0.290681  1.517684
9   1.073733  0.009069  1.434101 -0.324224
10 -1.914762 -0.265914 -2.622818 -0.203193
11  0.223135 -2.107193  0.335140 -1.229198
12 -0.935120  1.085023  1.426574 -0.055636
13 -1.210220  0.094843 -0.890266 -0.723416
14 -0.858159  0.079016  0.943580  0.401332

In [23]:
df2=df.rename({'Name':'Rename'},axis=1)

In [24]:
df2

           A         B         C         D
0  -0.793501  0.303682 -2.438304  0.135801
1  -0.317886 -0.382391 -0.030949  0.006409
2   0.713554 -1.474044 -1.611839  1.256339
3   1.152904  0.875935 -0.695734 -0.173973
4   0.349070  0.145427 -0.647036 -2.044697
5   0.411428 -1.026737 -1.153064 -1.858064
6  -0.022134 -0.838588  1.034511  1.086838
7   0.311615 -0.175301 -0.063252  2.947099
8   0.112965 -0.025156  0.290681  1.517684
9   1.073733  0.009069  1.434101 -0.324224
10 -1.914762 -0.265914 -2.622818 -0.203193
11  0.223135 -2.107193  0.335140 -1.229198
12 -0.935120  1.085023  1.426574 -0.055636
13 -1.210220  0.094843 -0.890266 -0.723416
14 -0.858159  0.079016  0.943580  0.401332

### Load csv, excel and Json file from location

#### Loading CSV file

In [25]:
cols=['id', 'belongs_to_collection', 'budget', 'genres', 'homepage',
       'imdb_id', 'original_language', 'original_title', 'overview',
       'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'runtime', 'spoken_languages',
       'status', 'tagline', 'title', 'Keywords', 'cast', 'crew', 'revenue']

In [26]:
#C:\Users\koser\Documents\Floatint Courses\Machine Learning From Scratch\C01L09- Chug Data, Spit Frames\data

In [27]:
df=pd.read_csv('./data/train.csv',
               header=None,names=cols,sep=',') #

In [28]:
df.head()

,id,belongs_to_collection,budget,genres,homepage,imdb_id,original_language,original_title,overview,popularity,...,release_date,runtime,spoken_languages,status,tagline,title,Keywords,cast,crew,revenue
0,id,belongs_to_collection,budget,genres,homepage,imdb_id,original_language,original_title,overview,popularity,...,release_date,runtime,spoken_languages,status,tagline,title,Keywords,cast,crew,revenue
1,1,"[{'id': 313576, 'name': 'Hot Tub Time Machine ...",14000000,"[{'id': 35, 'name': 'Comedy'}]",NaN,tt2637294,en,Hot Tub Time Machine 2,"When Lou, who has become the ""father of the In...",6.575393,...,2/20/15,93,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,The Laws of Space and Time are About to be Vio...,Hot Tub Time Machine 2,"[{'id': 4379, 'name': 'time travel'}, {'id': 9...","[{'cast_id': 4, 'character': 'Lou', 'credit_id...","[{'credit_id': '59ac067c92514107af02c8c8', 'de...",12314651
2,2,"[{'id': 107674, 'name': 'The Princess Diaries ...",40000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,tt0368933,en,The Princess Diaries 2: Royal Engagement,Mia Thermopolis is now a college graduate and ...,8.248895,...,8/6/04,113,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,It can take a lifetime to find true love; she'...,The Princess Diaries 2: Royal Engagement,"[{'id': 2505, 'name': 'coronation'}, {'id': 42...","[{'cast_id': 1, 'character': 'Mia Thermopolis'...","[{'credit_id': '52fe43fe9251416c7502563d', 'de...",95149435
3,3,NaN,3300000,"[{'id': 18, 'name': 'Drama'}]",http://sonyclassics.com/whiplash/,tt2582802,en,Whiplash,"Under the direction of a ruthless instructor, ...",64.29999,...,10/10/14,105,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,The road to greatness can take you to the edge.,Whiplash,"[{'id': 1416, 'name': 'jazz'}, {'id': 1523, 'n...","[{'cast_id': 5, 'character': 'Andrew Neimann',...","[{'credit_id': '54d5356ec3a3683ba0000039', 'de...",13092000
4,4,NaN,1200000,"[{'id': 53, 'name': 'Thriller'}, {'id': 18, 'n...",http://kahaanithefilm.com/,tt1821480,hi,Kahaani,Vidya Bagchi (Vidya Balan) arrives in Kolkata ...,3.174936,...,3/9/12,122,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,NaN,Kahaani,"[{'id': 10092, 'name': 'mystery'}, {'id': 1054...","[{'cast_id': 1, 'character': 'Vidya Bagchi', '...","[{'credit_id': '52fe48779251416c9108d6eb', 'de...",16000000

In [29]:
df.columns

Index(['id', 'belongs_to_collection', 'budget', 'genres', 'homepage',
       'imdb_id', 'original_language', 'original_title', 'overview',
       'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'runtime', 'spoken_languages',
       'status', 'tagline', 'title', 'Keywords', 'cast', 'crew', 'revenue'],
      dtype='object')

In [30]:
type(df['belongs_to_collection'])

pandas.core.series.Series

In [31]:
type(df)

pandas.core.frame.DataFrame

#### Loading excel file

In [32]:
# Excel file
file=pd.read_excel('./data/data_info.xlsx',sheet_name='train') # By default first sheet

In [33]:
type(file)

pandas.core.frame.DataFrame

In [34]:
file.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
Columns        6 non-null object
Description    6 non-null object
dtypes: object(2)
memory usage: 176.0+ bytes

#### Loading Json file

In [35]:
df = pd.read_json("./data/students.json",lines= True)

In [36]:
type(df)

pandas.core.frame.DataFrame

In [37]:
print(df.head())
print(df.tail())

   _id  exam   homework              name  quiz
0    0   1.5  35.874035        aimee Zank    12
1    1   2.8  36.000000  Aurelia Menendez    15
2    2   3.5  40.000000       Corliss Zuk    10
3    3   3.6  49.000000        Bao Ziglar    20
4    4   3.7  54.000000  Zachary Langlais    20
    _id  exam  homework              name  quiz
6     6   4.8     100.0  Jenette Flanders    16
7     7   3.2      54.0      Salena Olmos    17
8     8   3.1      43.0      Daphne Zheng    13
9     9   4.6      90.0        Sanda Ryba    19
10   10   3.9      67.0      Denisha Cast    18

### Topic 3: Saving file to location

#### Writing file to CSV

In [38]:
df.to_csv('./data/df_batch2.csv',sep=',',index=True,header=True)

#### Writing file to Excel

In [39]:
#df.to_excel('C:/Users/koser/Documents/Floatint Courses/Machine Learning From Scratch/C01L09- Chug Data, Spit Frames/data/df_batch2.xlsx',sheet_name='batch1')

#Multiple sheet in one sheet
with pd.ExcelWriter('./data/output_batch1.xlsx') as writer:
    df.to_excel(writer, sheet_name='Sheet_name_1_batch')
    df.to_excel(writer, sheet_name='Sheet_name_2')

#### Writing file to json

In [40]:
df

    _id  exam    homework              name  quiz
0     0   1.5   35.874035        aimee Zank    12
1     1   2.8   36.000000  Aurelia Menendez    15
2     2   3.5   40.000000       Corliss Zuk    10
3     3   3.6   49.000000        Bao Ziglar    20
4     4   3.7   54.000000  Zachary Langlais    20
5     5   4.9   96.000000    Wilburn Spiess    19
6     6   4.8  100.000000  Jenette Flanders    16
7     7   3.2   54.000000      Salena Olmos    17
8     8   3.1   43.000000      Daphne Zheng    13
9     9   4.6   90.000000        Sanda Ryba    19
10   10   3.9   67.000000      Denisha Cast    18

In [41]:
# Converting to json
df.to_json('./data/df_batch2.json',orient='index')  # orient='index' , orient='columns'

#### Writing file to pickle
<b>Python pickle module </b> is used for serializing and de-serializing a Python object structure. Any object in Python can be pickled so that it can be saved on disk. What pickle does is that it serializes the object first before writing it to file. Pickling is a way to convert a python object (list, dict, etc.) into a character stream. The idea is that this character stream contains all the information necessary to reconstruct the object in another python script.

In [42]:
df.to_pickle("./data/df_batch.pkl")

In [43]:
df=pd.read_pickle('./data/df_batch.pkl')

In [44]:
df

    _id  exam    homework              name  quiz
0     0   1.5   35.874035        aimee Zank    12
1     1   2.8   36.000000  Aurelia Menendez    15
2     2   3.5   40.000000       Corliss Zuk    10
3     3   3.6   49.000000        Bao Ziglar    20
4     4   3.7   54.000000  Zachary Langlais    20
5     5   4.9   96.000000    Wilburn Spiess    19
6     6   4.8  100.000000  Jenette Flanders    16
7     7   3.2   54.000000      Salena Olmos    17
8     8   3.1   43.000000      Daphne Zheng    13
9     9   4.6   90.000000        Sanda Ryba    19
10   10   3.9   67.000000      Denisha Cast    18

### No Assignment

### Thank You -- See you in next Class - More hands on Pandas